constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu      [0 2 -1 0 0 0 0] 1.382e-05; // 5 degree C
Pr      0.73; // Prandtl number
Prt     0.9; // Turbulent Prandtl number
Cpf     [0 2 -2 -1 0 0 0] 1004; // specific heat - air 5 degree C
Cps     [0 2 -2 -1 0 0 0] 3546.4; // specific heat - solid
rhof    [1 -3 0 0 0 0 0] 1.248; // density - fluid
rhos    [1 -3 0 0 0 0 0] 1169.9; // density - solid
Ks      [1 1 -3 -1 0 0 0] 0.554; // thermal conductivity - solid
Asf     [0 -1 0 0 0 0 0] 30.04; // specific surface area - fluid:solid
hsf     [1 0 -3 -1 0 0 0] 24.968; // convective coefficient - fluid:solid

// ************************************************************************* //
