system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    clamp_set;
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
          name clamp_0;
        };
    }
    {
        name    clamp_set;
        type    cellSet;
        action  add;
        source  zoneToCell;
        sourceInfo
        {
          name clamp_1;
        };
    }
    {
        name    clamp_set;
        type    cellSet;
        action  add;
        source  zoneToCell;
        sourceInfo
        {
          name clamp_2;
        };
    }
    {
        name    clamp_set;
        type    cellSet;
        action  add;
        source  zoneToCell;
        sourceInfo
        {
          name clamp_3;
        };
    }
    {
        name    clamp_set;
        type    cellSet;
        action  add;
        source  zoneToCell;
        sourceInfo
        {
          name clamp_4;
        };
    }
    {
        name    clamp_set;
        type    cellSet;
        action  add;
        source  zoneToCell;
        sourceInfo
        {
          name clamp_5;
        };
    }
    {
        name    clamp_set;
        type    cellSet;
        action  add;
        source  zoneToCell;
        sourceInfo
        {
          name clamp_6;
        };
    }
    {
      name    clamp_zone;
      type    cellZoneSet;
      action  new;
      source  setToCellZone;
      sourceInfo
      {
        set    clamp_set;
      }
    }
);

// ************************************************************************* //
